{
    "Profile Settings": "Configuración del perfil",
    "Profile": "Perfil",
    "Update your name and email address": "Actualiza tu nombre y dirección de correo electrónico",
    "Name": "Nombre",
    "Email": "Correo electrónico",
    "Save": "Guardar",
    "Saved.": "Guardado.",
    "Your email address is unverified.": "Tu dirección de correo electrónico no está verificada.",
    "Click here to re-send the verification email.": "Haz clic aquí para reenviar el correo de verificación.",
    "A new verification link has been sent to your email address.": "Se ha enviado un nuevo enlace de verificación a tu dirección de correo electrónico.",

    "Password Settings": "Configuración de contraseña",
    "Update password": "Actualizar contraseña",
    "Ensure your account is using a long, random password to stay secure": "Asegúrate de que tu cuenta utiliza una contraseña larga y aleatoria para mantenerse segura",
    "Current password": "Contraseña actual",
    "New password": "Nueva contraseña",
    "Confirm Password": "Confirmar contraseña",

    "Delete account": "Eliminar cuenta",
    "Delete your account and all of its resources": "Elimina tu cuenta y todos sus recursos",
    "Are you sure you want to delete your account?": "¿Estás seguro de que quieres eliminar tu cuenta?",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Please enter your password to confirm you would like to permanently delete your account.": "Una vez eliminada tu cuenta, todos sus recursos y datos se eliminarán permanentemente. Por favor, introduce tu contraseña para confirmar que deseas eliminar tu cuenta de forma permanente.",
    "Password": "Contraseña",
    "Cancel": "Cancelar",

    "Two-Factor Authentication Settings": "Configuración de autenticación en dos pasos",
    "Two Factor Authentication": "Autenticación en dos pasos",
    "Manage your two-factor authentication settings": "Gestiona la configuración de autenticación en dos pasos",
    "Enabled": "Activado",
    "Disabled": "Desactivado",
    "Enable 2FA": "Activar 2FA",
    "Disable 2FA": "Desactivar 2FA",
    "With two-factor authentication enabled, you will be prompted for a secure, random pin during login, which you can retrieve from the TOTP-supported application on your phone.": "Con la autenticación en dos pasos activada, se te pedirá un código seguro durante el inicio de sesión, que podrás obtener de la aplicación TOTP compatible en tu teléfono.",
    "When you enable two-factor authentication, you will be prompted for a secure pin during login. This pin can be retrieved from a TOTP-supported application on your phone.": "Cuando actives la autenticación en dos pasos, se te pedirá un código seguro durante el inicio de sesión. Este código lo puedes obtener de una aplicación TOTP compatible en tu teléfono.",
    "Back": "Volver",
    "Confirm": "Confirmar",
    "or, enter the code manually": "o introduce el código manualmente",

    "Two-Factor Authentication Enabled": "Autenticación en dos pasos activada",
    "Two-factor authentication is now enabled. Scan the QR code or enter the setup key in your authenticator app.": "La autenticación en dos pasos está activada. Escanea el código QR o introduce la clave de configuración en tu aplicación de autenticación.",
    "Close": "Cerrar",
    "Verify Authentication Code": "Verificar código de autenticación",
    "Enter the 6-digit code from your authenticator app.": "Introduce el código de 6 dígitos de tu aplicación de autenticación.",
    "Continue": "Continuar",
    "Enable Two-Factor Authentication": "Activar autenticación en dos pasos",
    "To finish enabling two-factor authentication, scan the QR code or enter the setup key in your authenticator app.": "Para terminar de activar la autenticación en dos pasos, escanea el código QR o introduce la clave de configuración en tu aplicación de autenticación.",
    "Failed to fetch setup data.": "Error al obtener los datos de configuración.",

    "2FA Recovery Codes": "Códigos de recuperación 2FA",
    "Recovery codes let you regain access if you lose your 2FA device. Store them in a secure password manager.": "Los códigos de recuperación te permiten recuperar el acceso si pierdes tu dispositivo 2FA. Guárdalos en un gestor de contraseñas seguro.",
    "View Recovery Codes": "Ver códigos de recuperación",
    "Hide Recovery Codes": "Ocultar códigos de recuperación",
    "Regenerate Codes": "Regenerar códigos",
    "Recovery codes": "Códigos de recuperación",
    "Each recovery code can be used once to access your account and will be removed after use. If you need more, click Regenerate Codes above.": "Cada código de recuperación se puede usar una sola vez para acceder a tu cuenta y se eliminará después de su uso. Si necesitas más, haz clic en Regenerar códigos arriba.",

    "Appearance Settings": "Configuración de apariencia",
    "Appearance": "Apariencia",
    "Update the appearance settings for your account": "Actualiza la configuración de apariencia de tu cuenta",
    "Light": "Claro",
    "Dark": "Oscuro",
    "System": "Sistema"
}
